with open('score/0308.musicxml','r',encoding='utf8') as f:
    read = f.read(-1)

    pinyin = '等無心愛的人猶原一咧人未輸咧夢中醒來總是空伊的批信無來苦苦我咧等待心中毋敢講我的央望你走去卓位予我無望大海總是茫茫夜夜咧等夜夜咧夢人生擱存幾冬心愛的人夢中的人暗夜存我一人有情的人請毋通未記阮的名若有來生請叫阮的名'
    pinyin = '你走去卓位予我無望大海總是茫茫夜夜咧等夜夜咧夢人生擱存幾冬心愛的人夢中的人暗夜存我一人有情的人請毋通未記阮的名若有來生請叫阮的名'
    pinyin = '若有來生請叫阮的名'
    pinyin = '猶原一咧人未輸咧夢中醒來總是空伊的批信無來苦苦我咧等待心中毋敢講我的央望你走去卓位予我無望大海總是茫茫夜夜咧等夜夜咧夢人生擱存幾冬心愛的人夢中的人暗夜存我一人有情的人請毋通未記阮的名'
    pinyin = '我的央望你走去卓位予我無望大海總是茫茫夜夜咧等夜夜咧夢人生擱存幾冬心愛的人夢中的人暗夜存我一人有情的人請毋通未記阮的名'
    pinyin = '一人有情的人請毋通未記阮的名'

    for i,c in enumerate(pinyin):
        read = read.replace('*{}*'.format(i),pinyin[i])
with open('score/0308.musicxml', 'w', encoding='utf8') as f:
    f.write(read)